<?
/**
 * Ôóíêöèÿ, êîòîğàÿ òğàíñëèòåğóåò ôàéëû.
 * Î×ÅÍÜ ÂÀÆÍÎ: ıòîò ôàéë äîëæåí áûòü â êîäèğîâêå win-1251
 * @param $str
 * @param int $length
 * @return string
 */
function NotaImTranslite($str, $length=15)
{
    static $tbl= array(
        'à'=>'a', 'á'=>'b', 'â'=>'v', 'ã'=>'g', 'ä'=>'d', 'å'=>'e', 'æ'=>'g', 'ç'=>'z',
        'è'=>'i', 'é'=>'y', 'ê'=>'k', 'ë'=>'l', 'ì'=>'m', 'í'=>'n', 'î'=>'o', 'ï'=>'p',
        'ğ'=>'r', 'ñ'=>'s', 'ò'=>'t', 'ó'=>'u', 'ô'=>'f', 'û'=>'y', 'ı'=>'e', 'À'=>'A',
        'Á'=>'B', 'Â'=>'V', 'Ã'=>'G', 'Ä'=>'D', 'Å'=>'E', 'Æ'=>'G', 'Ç'=>'Z', 'È'=>'I',
        'É'=>'Y', 'Ê'=>'K', 'Ë'=>'L', 'Ì'=>'M', 'Í'=>'N', 'Î'=>'O', 'Ï'=>'P', 'Ğ'=>'R',
        'Ñ'=>'S', 'Ò'=>'T', 'Ó'=>'U', 'Ô'=>'F', 'Û'=>'Y', 'İ'=>'E', '¸'=>"yo", 'õ'=>"h",
        'ö'=>"ts", '÷'=>"ch", 'ø'=>"sh", 'ù'=>"shch", 'ú'=>"", 'ü'=>"", 'ş'=>"yu", 'ÿ'=>"ya",
        '¨'=>"YO", 'Õ'=>"H", 'Ö'=>"TS", '×'=>"CH", 'Ø'=>"SH", 'Ù'=>"SHCH", 'Ú'=>"", 'Ü'=>"",
        'Ş'=>"YU", 'ß'=>"YA", '.'=>"", '&'=>"i", '"'=>"", ' '=>"_", '¹'=>"", '«'=>"", '»'=>"",
        '('=>"", ')'=>"", '—'=>"-", ','=>"", '?'=>'', '!'=>''
    );
    $str=substr(trim(strtr($str, $tbl),'-_'),0,$length);
    return $str;
}
